MoseychukA/FLARM_ALL/NEW_DOUBLE/Soft/ESP32/Base_ESP32/NEWnet/Arhiv/FlyRf_Base_25_11_09_00/CoreCommandBuffer.cpp
#include "CoreCommandBuffer.h"
#include <malloc.h>
#include <stdlib.h>
#include <stdio.h>
#include "ServiceMain.h"
#include "Configuration_ESP32.h"
#include <Stream.h>
#include "TrafficHelper.h"
#include "NMEA.h"
#include "GNSS.h"
#include "SoftRF.h"
#include <TimeLib.h>
#include "ESP32RF.h"
#include "EEPROMRF.h"
#include <math.h>
#include "RF.h"
#include "SoC.h"
#include "ServiceMain.h"
#include <SoftwareSerial.h>

EspSoftwareSerial::UART SERIAL_TRACKER;

extern SemaphoreHandle_t containerMutex;  // Мьютекс для защиты базы
//--------------------------------------------------------------------------------------------------------------------------------------
// отправить команду на контроллер дисплея. список поддерживаемых команд
//--------------------------------------------------------------------------------------------------------------------------------------
const char VERSION_COMMAND[]      PROGMEM = "VER";      // отдать информацию о версии.                 Пример #1#GET#VER
const char VERSION_COMMAND_M[]    PROGMEM = "ver";      // отдать информацию о версии.                 Пример #1#GET#VER
const char TEXT_COMMAND[]         PROGMEM = "TXT";      // отправить текст на треккер.                 Пример #1#SET#TXT#далее следует строка текста
const char TEXT_COMMAND_M[]       PROGMEM = "txt";      // отправить текст на треккер.                 Пример #1#SET#TXT#далее следует строка текста
const char CLEAR_MESSAGE[]        PROGMEM = "CLEARMESSAGE";// Очистить все сообщения.                  Пример #1#SET#CLEARMESSAGE
const char SET_FLY[]              PROGMEM = "FLY";      // Установить параметры стороннего самолета
const char SET_FLY_M[]            PROGMEM = "fly";      // Установить параметры стороннего самолета
const char GET_FLY[]              PROGMEM = "FLY";      // Получить параметры нашего самолета
const char GET_FLY_M[]            PROGMEM = "fly";      // Установить параметры нашего самолета
const char GET_BASE[]             PROGMEM = "BASE";     // Получить параметры бызы сторонних самолетов
const char GET_BASE_M[]           PROGMEM = "base";     // Получить параметры бызы сторонних самолетов
const char SET_GSM[]              PROGMEM = "GSM";      // Установить параметры передачи данных по GSM
const char SET_GSM_M[]            PROGMEM = "gsm";      // Установить параметры передачи данных по GSM
const char SET_BT_OK[]            PROGMEM = "BTOK";     // Установить подтверждение прочтения сообщения по GSM
const char SET_BT_OK_M[]          PROGMEM = "btok";     // Установить подтверждение прочтения сообщения по GSM
//--------------------------------------------------------------------------------------------------------------------------------------
CoreCommandBuffer Commands(&SERIAL_TRACKER);// , Commands(&SERIAL_BLUETOOTH); //SoC->Bluetooth_ops
//--------------------------------------------------------------------------------------------------------------------------------------

CoreCommandBuffer::CoreCommandBuffer(Stream* s) : pStream(s) // конструктор
{
    strBuff = new String();
    strBuff->reserve(BUFFER_SIZE+20);
}
//--------------------------------------------------------------------------------------------------------------------------------------
bool CoreCommandBuffer::hasCommand()                // проверяет на наличие входящей команды
{
  if(!(pStream && pStream->available()))
  {
    return false;
  }

    char ch; 

    if (pStream->available())                       // Определить наличие символа в порту трекера
    {
        while (pStream->available()>0)              // читаем данные во внутренний буфер
        {
            ch = (char)pStream->read();

            if (ch == '\r')                         // Пропустить, не записывать в буфер
            {
                continue;
            }
 
            if (ch == '\n')                         // Пропустить, не записывать в буфер
            {
                continue;
            } // if

            *strBuff += ch;

            delay(5);
            // не даём вычитать больше символов, чем надо - иначе нас можно заспамить
            if (strBuff->length() >= BUFFER_SIZE)   // Если иформации больше чем BUFFER_SIZE - принимать не будем и очистим буфер
            {
                pStream->print(CORE_COMMAND_ANSWER_ERROR);
                pStream->println(F("The text is very long. !Maximum 174 characters"));
                clearCommand();
                return true;
            } // if
        } // while

       // SettingsMain.setNumber_from_Message(strBuff->length());
       return true;   // Завершили чтение сообщения. Информация находится в strBuff
    }
    return false;     // Новой информации не поступало.
}


bool CoreCommandBuffer::bluetoothCommand()                // проверяет на наличие входящей команды из Bluetooth
{
    if (!(pStream && SoC->Bluetooth_ops->available()))
    {
        return false;
    }

    char ch;

    if (SoC->Bluetooth_ops->available())                       // Определить наличие символа в порту трекера
    {
        while (SoC->Bluetooth_ops->available() > 0)              // читаем данные во внутренний буфер
        {
            ch = (char)SoC->Bluetooth_ops->read();

            if (ch == '\r')                         // Пропустить, не записывать в буфер
            {
                continue;
            } 

            if (ch == '\n')                         // Пропустить, не записывать в буфер
            {
                continue;
            } // if

            *strBuff += ch;

            delay(5);
            // не даём вычитать больше символов, чем надо - иначе нас можно заспамить
            if (strBuff->length() >= BUFFER_SIZE)   // Если иформации больше чем BUFFER_SIZE - принимать не будем и очистим буфер
            {
                pStream->print(CORE_COMMAND_ANSWER_ERROR);
                pStream->println(F("The text is very long. !Maximum 174 characters")); 
                clearCommand();
                return true;
            } // if
        } // while
        return true;   // Завершили чтение сообщения. Информация находится в strBuff
    }
    return false;     // Новой информации не поступало.
}

//--------------------------------------------------------------------------------------------------------------------------------------
CommandParser::CommandParser() // констуктор
{
  
