MoseychukA/FLARM_ALL/NEW_DOUBLE/Soft/ESP32/Base_ESP32/NEWnet/Arhiv/FlyRf_Base_25_11_09_00/CoreCommandBuffer.cpp
                    if (!strcmp_P(commandName, CLEAR_MESSAGE))           // Стереть всю память
					{
    					commandHandled = clear_Message(commandName, cParser, pStream);
					}  

                    else if (!strcmp_P(commandName, SET_FLY)|| !strcmp_P(commandName, SET_FLY_M))              // Установить параметры стороннего самолета
                    {
                        if (cParser.argsCount() > 1)
                        {

                            const char* paramPtr = cParser.getArg(3);
                            commandHandled = printBackSETResult(setFly(paramPtr), commandName, pStream);
                        }
                        else
                        {
                            // недостаточно параметров
                            commandHandled = printBackSETResult(false, commandName, pStream);
                        }

                    }
                    else if (!strcmp_P(commandName, SET_GSM)|| !strcmp_P(commandName, SET_GSM_M))              // Установить параметры передачи данных по GSM
                    {
                        if (cParser.argsCount() > 2)
                        {

                            const char* paramPtr = cParser.getArg(3);
                            commandHandled = setGSM(commandName, cParser, pStream);
                        }
                        else
                        {
                            // недостаточно параметров
                            commandHandled = printBackSETResult(false, commandName, pStream);
                        }
                    }
                    else if (!strcmp_P(commandName, SET_BT_OK) || !strcmp_P(commandName, SET_BT_OK_M))              // Установить подтверждение прочтения сообщения по GSM
                    {
                        if (cParser.argsCount() > 2)
                        {

                            const char* paramPtr = cParser.getArg(3);
                            commandHandled = setBTOK(commandName, cParser, pStream);
                        }
                        else
                        {
                            // недостаточно параметров
                            commandHandled = printBackSETResult(false, commandName, pStream);
                        }
                    }
                    else if (!strcmp_P(commandName, TEXT_COMMAND) || !strcmp_P(commandName, TEXT_COMMAND_M))              // Установить подтверждение прочтения сообщения по GSM
                    {
                        if (cParser.argsCount() > 2)
                        {
                            const char* paramPtr = cParser.getArg(1);
                            commandHandled = setTXT(commandName, cParser, pStream, textString);
                        }
                        else
                        {
                            // недостаточно параметров
                            commandHandled = printBackSETResult(false, commandName, pStream);
                        }
                    }

				} // SET COMMAND

				else if (textString.startsWith(CORE_COMMAND_GET)|| textString.startsWith(CORE_COMMAND_GET_M)) // команда на получение свойств
				{
				    const char* commandName = cParser.getArg(2);
                        
                    if (!strcmp_P(commandName, VERSION_COMMAND)||!strcmp_P(commandName, VERSION_COMMAND_M)) // получение версии ПО 
				    {
                        if (cParser.argsCount() > 1)
                        {
                            commandHandled = getVER(pStream);
                        }
                        else
                        {
                            // недостаточно параметров
                            commandHandled = printBackSETResult(false, commandName, pStream);
                        }
				    }
                    else if (!strcmp_P(commandName, GET_FLY)|| !strcmp_P(commandName, GET_FLY_M)) // получение данных из базы самолетов. 
                    {
                        if (cParser.argsCount() > 2)
                        {
                            commandHandled = getFly(pStream); // получение информацию с базы данных
                        }
                        else
                        {
                            // недостаточно параметров
                            commandHandled = printBackSETResult(false, commandName, pStream);
                        }
                    }
                    else if (!strcmp_P(commandName, GET_BASE) || !strcmp_P(commandName, GET_BASE_M)) // получение данных из базы самолетов. 
                    {
                        if (cParser.argsCount() > 2)
                        {
                            commandHandled = getBase(pStream); // получение информацию с базы данных
                        }
                        else
                        {
                            // недостаточно параметров
                            commandHandled = printBackSETResult(false, commandName, pStream);
                        }
                    }

				}// GET COMMAND
			}
			else  // Получить текстовую команду
			{
				commandHandled = setTXT(commandName, cParser, pStream, textString);
			}
        }
    }
 
    if (!commandHandled)
    {
        onUnknownCommand(command, pStream);
    }
}
//--------------------------------------------------------------------------------------------------------------------------------------

void CommandHandlerClass::onUnknownCommand(const String& command, Stream* outStream) // обработчик неизвестной команды
{
    outStream->print(CORE_COMMAND_ANSWER_ERROR);
    outStream->println(F("UNKNOWN COMMAND"));  
}

//--------------------------------------------------------------------------------------------------------------------------------------
bool CommandHandlerClass::getVER(Stream* pStream) // получение версии ПО
{  
    char str_ver[32];
    String ver = service.getVer();
    ver.toCharArray(str_ver, 32);

    pStream->print(CORE_COMMAND_ANSWER_OK);
    pStream->print(CORE_COMMAND_PARAM_DELIMITER);

    //pStream->print(F("FlyRf "));
    pStream->println(str_ver);

